#### SlopeDegree Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol Â°, indicating unit Slope degrees.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SlopeDegree { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SlopeDegree As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SlopeDegree { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace